konstantin-dzreev/bare-metal-rp2350-riscv/include/hardware/regs/uart.inc
#
# Derived from Raspberry Pi Pico SDK
#
# Copyright (c) 2024 Raspberry Pi Ltd.
#
# Redistribution and use permitted under BSD 3-Clause terms.
# See full license in THIRD_PARTY_LICENSES/PICO_SDK_LICENSE.txt
#
# =============================================================================
# Register block : UART
# Version        : 1
# Bus type       : apb
# =============================================================================
.ifndef	_HARDWARE_REGS_UART_H
.set	_HARDWARE_REGS_UART_H, 1
# =============================================================================
# Register    : UART_UARTDR
# Description : Data Register, UARTDR
.equ	UART_UARTDR_OFFSET, 0x00000000
.equ	UART_UARTDR_BITS, 0x00000fff
.equ	UART_UARTDR_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : UART_UARTDR_OE
# Description : Overrun error. This bit is set to 1 if data is received and the
#               receive FIFO is already full. This is cleared to 0 once there
#               is an empty space in the FIFO and a new character can be
#               written to it.
.equ	UART_UARTDR_OE_BITS, 0x00000800
.equ	UART_UARTDR_OE_MSB, 11
.equ	UART_UARTDR_OE_LSB, 11
# -----------------------------------------------------------------------------
# Field       : UART_UARTDR_BE
# Description : Break error. This bit is set to 1 if a break condition was
#               detected, indicating that the received data input was held LOW
#               for longer than a full-word transmission time (defined as
#               start, data, parity and stop bits). In FIFO mode, this error is
#               associated with the character at the top of the FIFO. When a
#               break occurs, only one 0 character is loaded into the FIFO. The
#               next character is only enabled after the receive data input
#               goes to a 1 (marking state), and the next valid start bit is
#               received.
.equ	UART_UARTDR_BE_BITS, 0x00000400
.equ	UART_UARTDR_BE_MSB, 10
.equ	UART_UARTDR_BE_LSB, 10
# -----------------------------------------------------------------------------
# Field       : UART_UARTDR_PE
# Description : Parity error. When set to 1, it indicates that the parity of
#               the received data character does not match the parity that the
#               EPS and SPS bits in the Line Control Register, UARTLCR_H. In
#               FIFO mode, this error is associated with the character at the
#               top of the FIFO.
.equ	UART_UARTDR_PE_BITS, 0x00000200
.equ	UART_UARTDR_PE_MSB, 9
.equ	UART_UARTDR_PE_LSB, 9
# -----------------------------------------------------------------------------
# Field       : UART_UARTDR_FE
# Description : Framing error. When set to 1, it indicates that the received
#               character did not have a valid stop bit (a valid stop bit is
#               1). In FIFO mode, this error is associated with the character
#               at the top of the FIFO.
.equ	UART_UARTDR_FE_BITS, 0x00000100
.equ	UART_UARTDR_FE_MSB, 8
.equ	UART_UARTDR_FE_LSB, 8
# -----------------------------------------------------------------------------
# Field       : UART_UARTDR_DATA
# Description : Receive (read) data character. Transmit (write) data character.
.equ	UART_UARTDR_DATA_BITS, 0x000000ff
.equ	UART_UARTDR_DATA_MSB, 7
.equ	UART_UARTDR_DATA_LSB, 0
# =============================================================================
# Register    : UART_UARTRSR
# Description : Receive Status Register/Error Clear Register, UARTRSR/UARTECR
.equ	UART_UARTRSR_OFFSET, 0x00000004
.equ	UART_UARTRSR_BITS, 0x0000000f
.equ	UART_UARTRSR_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : UART_UARTRSR_OE
# Description : Overrun error. This bit is set to 1 if data is received and the
#               FIFO is already full. This bit is cleared to 0 by a write to
#               UARTECR. The FIFO contents remain valid because no more data is
#               written when the FIFO is full, only the contents of the shift
#               register are overwritten. The CPU must now read the data, to
#               empty the FIFO.
.equ	UART_UARTRSR_OE_RESET, 0x0
.equ	UART_UARTRSR_OE_BITS, 0x00000008
.equ	UART_UARTRSR_OE_MSB, 3
.equ	UART_UARTRSR_OE_LSB, 3
# -----------------------------------------------------------------------------
# Field       : UART_UARTRSR_BE
# Description : Break error. This bit is set to 1 if a break condition was
#               detected, indicating that the received data input was held LOW
#               for longer than a full-word transmission time (defined as
#               start, data, parity, and stop bits). This bit is cleared to 0
#               after a write to UARTECR. In FIFO mode, this error is
#               associated with the character at the top of the FIFO. When a
#               break occurs, only one 0 character is loaded into the FIFO. The
#               next character is only enabled after the receive data input
#               goes to a 1 (marking state) and the next valid start bit is
#               received.
.equ	UART_UARTRSR_BE_RESET, 0x0
.equ	UART_UARTRSR_BE_BITS, 0x00000004
.equ	UART_UARTRSR_BE_MSB, 2
.equ	UART_UARTRSR_BE_LSB, 2
# -----------------------------------------------------------------------------
# Field       : UART_UARTRSR_PE
# Description : Parity error. When set to 1, it indicates that the parity of
#               the received data character does not match the parity that the
#               EPS and SPS bits in the Line Control Register, UARTLCR_H. This
#               bit is cleared to 0 by a write to UARTECR. In FIFO mode, this
#               error is associated with the character at the top of the FIFO.
.equ	UART_UARTRSR_PE_RESET, 0x0
.equ	UART_UARTRSR_PE_BITS, 0x00000002
.equ	UART_UARTRSR_PE_MSB, 1
.equ	UART_UARTRSR_PE_LSB, 1
# -----------------------------------------------------------------------------
# Field       : UART_UARTRSR_FE
# Description : Framing error. When set to 1, it indicates that the received
#               character did not have a valid stop bit (a valid stop bit is
#               1). This bit is cleared to 0 by a write to UARTECR. In FIFO
#               mode, this error is associated with the character at the top of
#               the FIFO.
.equ	UART_UARTRSR_FE_RESET, 0x0
.equ	UART_UARTRSR_FE_BITS, 0x00000001
.equ	UART_UARTRSR_FE_MSB, 0
.equ	UART_UARTRSR_FE_LSB, 0
# =============================================================================
# Register    : UART_UARTFR
# Description : Flag Register, UARTFR
.equ	UART_UARTFR_OFFSET, 0x00000018
.equ	UART_UARTFR_BITS, 0x000001ff
.equ	UART_UARTFR_RESET, 0x00000090
# -----------------------------------------------------------------------------
# Field       : UART_UARTFR_RI
# Description : Ring indicator. This bit is the complement of the UART ring
#               indicator, nUARTRI, modem status input. That is, the bit is 1
#               when nUARTRI is LOW.
.equ	UART_UARTFR_RI_BITS, 0x00000100
.equ	UART_UARTFR_RI_MSB, 8
.equ	UART_UARTFR_RI_LSB, 8
# -----------------------------------------------------------------------------
# Field       : UART_UARTFR_TXFE
# Description : Transmit FIFO empty. The meaning of this bit depends on the
#               state of the FEN bit in the Line Control Register, UARTLCR_H.
#               If the FIFO is disabled, this bit is set when the transmit
#               holding register is empty. If the FIFO is enabled, the TXFE bit
#               is set when the transmit FIFO is empty. This bit does not
#               indicate if there is data in the transmit shift register.
.equ	UART_UARTFR_TXFE_RESET, 0x1
.equ	UART_UARTFR_TXFE_BITS, 0x00000080
.equ	UART_UARTFR_TXFE_MSB, 7
.equ	UART_UARTFR_TXFE_LSB, 7
# -----------------------------------------------------------------------------
# Field       : UART_UARTFR_RXFF
# Description : Receive FIFO full. The meaning of this bit depends on the state
#               of the FEN bit in the UARTLCR_H Register. If the FIFO is
#               disabled, this bit is set when the receive holding register is
#               full. If the FIFO is enabled, the RXFF bit is set when the
#               receive FIFO is full.
.equ	UART_UARTFR_RXFF_RESET, 0x0
.equ	UART_UARTFR_RXFF_BITS, 0x00000040
.equ	UART_UARTFR_RXFF_MSB, 6
.equ	UART_UARTFR_RXFF_LSB, 6
# -----------------------------------------------------------------------------
# Field       : UART_UARTFR_TXFF
# Description : Transmit FIFO full. The meaning of this bit depends on the
#               state of the FEN bit in the UARTLCR_H Register. If the FIFO is
#               disabled, this bit is set when the transmit holding register is
#               full. If the FIFO is enabled, the TXFF bit is set when the
#               transmit FIFO is full.
.equ	UART_UARTFR_TXFF_RESET, 0x0
.equ	UART_UARTFR_TXFF_BITS, 0x00000020
.equ	UART_UARTFR_TXFF_MSB, 5
.equ	UART_UARTFR_TXFF_LSB, 5
# -----------------------------------------------------------------------------
# Field       : UART_UARTFR_RXFE
# Description : Receive FIFO empty. The meaning of this bit depends on the
#               state of the FEN bit in the UARTLCR_H Register. If the FIFO is
#               disabled, this bit is set when the receive holding register is
#               empty. If the FIFO is enabled, the RXFE bit is set when the
#               receive FIFO is empty.
.equ	UART_UARTFR_RXFE_RESET, 0x1
.equ	UART_UARTFR_RXFE_BITS, 0x00000010
.equ	UART_UARTFR_RXFE_MSB, 4
.equ	UART_UARTFR_RXFE_LSB, 4
# -----------------------------------------------------------------------------
# Field       : UART_UARTFR_BUSY
# Description : UART busy. If this bit is set to 1, the UART is busy
#               transmitting data. This bit remains set until the complete
#               byte, including all the stop bits, has been sent from the shift
#               register. This bit is set as soon as the transmit FIFO becomes
#               non-empty, regardless of whether the UART is enabled or not.
.equ	UART_UARTFR_BUSY_RESET, 0x0
.equ	UART_UARTFR_BUSY_BITS, 0x00000008
.equ	UART_UARTFR_BUSY_MSB, 3
.equ	UART_UARTFR_BUSY_LSB, 3
# -----------------------------------------------------------------------------
# Field       : UART_UARTFR_DCD
# Description : Data carrier detect. This bit is the complement of the UART
#               data carrier detect, nUARTDCD, modem status input. That is, the
#               bit is 1 when nUARTDCD is LOW.
.equ	UART_UARTFR_DCD_BITS, 0x00000004
.equ	UART_UARTFR_DCD_MSB, 2
.equ	UART_UARTFR_DCD_LSB, 2
# -----------------------------------------------------------------------------
# Field       : UART_UARTFR_DSR
# Description : Data set ready. This bit is the complement of the UART data set
#               ready, nUARTDSR, modem status input. That is, the bit is 1 when
#               nUARTDSR is LOW.
.equ	UART_UARTFR_DSR_BITS, 0x00000002
.equ	UART_UARTFR_DSR_MSB, 1
.equ	UART_UARTFR_DSR_LSB, 1
# -----------------------------------------------------------------------------
# Field       : UART_UARTFR_CTS
# Description : Clear to send. This bit is the complement of the UART clear to
#               send, nUARTCTS, modem status input. That is, the bit is 1 when
#               nUARTCTS is LOW.
.equ	UART_UARTFR_CTS_BITS, 0x00000001
.equ	UART_UARTFR_CTS_MSB, 0
.equ	UART_UARTFR_CTS_LSB, 0
# =============================================================================
# Register    : UART_UARTILPR
# Description : IrDA Low-Power Counter Register, UARTILPR
.equ	UART_UARTILPR_OFFSET, 0x00000020
.equ	UART_UARTILPR_BITS, 0x000000ff
.equ	UART_UARTILPR_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : UART_UARTILPR_ILPDVSR
# Description : 8-bit low-power divisor value. These bits are cleared to 0 at
#               reset.
.equ	UART_UARTILPR_ILPDVSR_RESET, 0x00
.equ	UART_UARTILPR_ILPDVSR_BITS, 0x000000ff
.equ	UART_UARTILPR_ILPDVSR_MSB, 7
.equ	UART_UARTILPR_ILPDVSR_LSB, 0
# =============================================================================
# Register    : UART_UARTIBRD
# Description : Integer Baud Rate Register, UARTIBRD
.equ	UART_UARTIBRD_OFFSET, 0x00000024
.equ	UART_UARTIBRD_BITS, 0x0000ffff
.equ	UART_UARTIBRD_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : UART_UARTIBRD_BAUD_DIVINT
# Description : The integer baud rate divisor. These bits are cleared to 0 on
#               reset.
.equ	UART_UARTIBRD_BAUD_DIVINT_RESET, 0x0000
.equ	UART_UARTIBRD_BAUD_DIVINT_BITS, 0x0000ffff
.equ	UART_UARTIBRD_BAUD_DIVINT_MSB, 15
.equ	UART_UARTIBRD_BAUD_DIVINT_LSB, 0
# =============================================================================
# Register    : UART_UARTFBRD
# Description : Fractional Baud Rate Register, UARTFBRD
.equ	UART_UARTFBRD_OFFSET, 0x00000028
.equ	UART_UARTFBRD_BITS, 0x0000003f
.equ	UART_UARTFBRD_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : UART_UARTFBRD_BAUD_DIVFRAC
# Description : The fractional baud rate divisor. These bits are cleared to 0
#               on reset.
.equ	UART_UARTFBRD_BAUD_DIVFRAC_RESET, 0x00
.equ	UART_UARTFBRD_BAUD_DIVFRAC_BITS, 0x0000003f
.equ	UART_UARTFBRD_BAUD_DIVFRAC_MSB, 5
.equ	UART_UARTFBRD_BAUD_DIVFRAC_LSB, 0
# =============================================================================
# Register    : UART_UARTLCR_H
# Description : Line Control Register, UARTLCR_H
.equ	UART_UARTLCR_H_OFFSET, 0x0000002c
.equ	UART_UARTLCR_H_BITS, 0x000000ff
.equ	UART_UARTLCR_H_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : UART_UARTLCR_H_SPS
# Description : Stick parity select. 0 = stick parity is disabled 1 = either: *
#               if the EPS bit is 0 then the parity bit is transmitted and
#               checked as a 1 * if the EPS bit is 1 then the parity bit is
#               transmitted and checked as a 0. This bit has no effect when the
#               PEN bit disables parity checking and generation.
.equ	UART_UARTLCR_H_SPS_RESET, 0x0
.equ	UART_UARTLCR_H_SPS_BITS, 0x00000080
.equ	UART_UARTLCR_H_SPS_MSB, 7
.equ	UART_UARTLCR_H_SPS_LSB, 7
# -----------------------------------------------------------------------------
# Field       : UART_UARTLCR_H_WLEN
# Description : Word length. These bits indicate the number of data bits
#               transmitted or received in a frame as follows: b11 = 8 bits b10
#               = 7 bits b01 = 6 bits b00 = 5 bits.
.equ	UART_UARTLCR_H_WLEN_RESET, 0x0
.equ	UART_UARTLCR_H_WLEN_BITS, 0x00000060
.equ	UART_UARTLCR_H_WLEN_MSB, 6
.equ	UART_UARTLCR_H_WLEN_LSB, 5
# -----------------------------------------------------------------------------
# Field       : UART_UARTLCR_H_FEN
# Description : Enable FIFOs: 0 = FIFOs are disabled (character mode) that is,
#               the FIFOs become 1-byte-deep holding registers 1 = transmit and
#               receive FIFO buffers are enabled (FIFO mode).
.equ	UART_UARTLCR_H_FEN_RESET, 0x0
.equ	UART_UARTLCR_H_FEN_BITS, 0x00000010
.equ	UART_UARTLCR_H_FEN_MSB, 4
.equ	UART_UARTLCR_H_FEN_LSB, 4
# -----------------------------------------------------------------------------
# Field       : UART_UARTLCR_H_STP2
# Description : Two stop bits select. If this bit is set to 1, two stop bits
#               are transmitted at the end of the frame. The receive logic does
#               not check for two stop bits being received.
.equ	UART_UARTLCR_H_STP2_RESET, 0x0
.equ	UART_UARTLCR_H_STP2_BITS, 0x00000008
.equ	UART_UARTLCR_H_STP2_MSB, 3
.equ	UART_UARTLCR_H_STP2_LSB, 3
# -----------------------------------------------------------------------------
# Field       : UART_UARTLCR_H_EPS
# Description : Even parity select. Controls the type of parity the UART uses
#               during transmission and reception: 0 = odd parity. The UART
#               generates or checks for an odd number of 1s in the data and
#               parity bits. 1 = even parity. The UART generates or checks for
#               an even number of 1s in the data and parity bits. This bit has
#               no effect when the PEN bit disables parity checking and
#               generation.
.equ	UART_UARTLCR_H_EPS_RESET, 0x0
.equ	UART_UARTLCR_H_EPS_BITS, 0x00000004
.equ	UART_UARTLCR_H_EPS_MSB, 2
.equ	UART_UARTLCR_H_EPS_LSB, 2
# -----------------------------------------------------------------------------
# Field       : UART_UARTLCR_H_PEN
# Description : Parity enable: 0 = parity is disabled and no parity bit added
#               to the data frame 1 = parity checking and generation is
#               enabled.
.equ	UART_UARTLCR_H_PEN_RESET, 0x0
.equ	UART_UARTLCR_H_PEN_BITS, 0x00000002
.equ	UART_UARTLCR_H_PEN_MSB, 1
.equ	UART_UARTLCR_H_PEN_LSB, 1
# -----------------------------------------------------------------------------
# Field       : UART_UARTLCR_H_BRK
# Description : Send break. If this bit is set to 1, a low-level is continually
#               output on the UARTTXD output, after completing transmission of
#               the current character. For the proper execution of the break
#               command, the software must set this bit for at least two
#               complete frames. For normal use, this bit must be cleared to 0.
.equ	UART_UARTLCR_H_BRK_RESET, 0x0
.equ	UART_UARTLCR_H_BRK_BITS, 0x00000001
.equ	UART_UARTLCR_H_BRK_MSB, 0
.equ	UART_UARTLCR_H_BRK_LSB, 0
# =============================================================================
# Register    : UART_UARTCR
# Description : Control Register, UARTCR
.equ	UART_UARTCR_OFFSET, 0x00000030
.equ	UART_UARTCR_BITS, 0x0000ff87
.equ	UART_UARTCR_RESET, 0x00000300
# -----------------------------------------------------------------------------
# Field       : UART_UARTCR_CTSEN
# Description : CTS hardware flow control enable. If this bit is set to 1, CTS
#               hardware flow control is enabled. Data is only transmitted when
#               the nUARTCTS signal is asserted.
.equ	UART_UARTCR_CTSEN_RESET, 0x0
.equ	UART_UARTCR_CTSEN_BITS, 0x00008000
.equ	UART_UARTCR_CTSEN_MSB, 15
.equ	UART_UARTCR_CTSEN_LSB, 15
# -----------------------------------------------------------------------------
# Field       : UART_UARTCR_RTSEN
# Description : RTS hardware flow control enable. If this bit is set to 1, RTS
#               hardware flow control is enabled. Data is only requested when
#               there is space in the receive FIFO for it to be received.
.equ	UART_UARTCR_RTSEN_RESET, 0x0
.equ	UART_UARTCR_RTSEN_BITS, 0x00004000
.equ	UART_UARTCR_RTSEN_MSB, 14
.equ	UART_UARTCR_RTSEN_LSB, 14
# -----------------------------------------------------------------------------
# Field       : UART_UARTCR_OUT2
# Description : This bit is the complement of the UART Out2 (nUARTOut2) modem
#               status output. That is, when the bit is programmed to a 1, the
#               output is 0. For DTE this can be used as Ring Indicator (RI).
.equ	UART_UARTCR_OUT2_RESET, 0x0
.equ	UART_UARTCR_OUT2_BITS, 0x00002000
.equ	UART_UARTCR_OUT2_MSB, 13
.equ	UART_UARTCR_OUT2_LSB, 13
# -----------------------------------------------------------------------------
# Field       : UART_UARTCR_OUT1
# Description : This bit is the complement of the UART Out1 (nUARTOut1) modem
#               status output. That is, when the bit is programmed to a 1 the
#               output is 0. For DTE this can be used as Data Carrier Detect
#               (DCD).
.equ	UART_UARTCR_OUT1_RESET, 0x0
.equ	UART_UARTCR_OUT1_BITS, 0x00001000
.equ	UART_UARTCR_OUT1_MSB, 12
.equ	UART_UARTCR_OUT1_LSB, 12
# -----------------------------------------------------------------------------
# Field       : UART_UARTCR_RTS
# Description : Request to send. This bit is the complement of the UART request
#               to send, nUARTRTS, modem status output. That is, when the bit
#               is programmed to a 1 then nUARTRTS is LOW.
.equ	UART_UARTCR_RTS_RESET, 0x0
.equ	UART_UARTCR_RTS_BITS, 0x00000800
.equ	UART_UARTCR_RTS_MSB, 11
.equ	UART_UARTCR_RTS_LSB, 11
# -----------------------------------------------------------------------------
# Field       : UART_UARTCR_DTR
# Description : Data transmit ready. This bit is the complement of the UART
#               data transmit ready, nUARTDTR, modem status output. That is,
#               when the bit is programmed to a 1 then nUARTDTR is LOW.
.equ	UART_UARTCR_DTR_RESET, 0x0
.equ	UART_UARTCR_DTR_BITS, 0x00000400
.equ	UART_UARTCR_DTR_MSB, 10
.equ	UART_UARTCR_DTR_LSB, 10
# -----------------------------------------------------------------------------
# Field       : UART_UARTCR_RXE
# Description : Receive enable. If this bit is set to 1, the receive section of
#               the UART is enabled. Data reception occurs for either UART
#               signals or SIR signals depending on the setting of the SIREN
#               bit. When the UART is disabled in the middle of reception, it
#               completes the current character before stopping.
.equ	UART_UARTCR_RXE_RESET, 0x1
.equ	UART_UARTCR_RXE_BITS, 0x00000200
.equ	UART_UARTCR_RXE_MSB, 9
.equ	UART_UARTCR_RXE_LSB, 9
# -----------------------------------------------------------------------------
# Field       : UART_UARTCR_TXE
# Description : Transmit enable. If this bit is set to 1, the transmit section
#               of the UART is enabled. Data transmission occurs for either
#               UART signals, or SIR signals depending on the setting of the
#               SIREN bit. When the UART is disabled in the middle of
#               transmission, it completes the current character before
#               stopping.
.equ	UART_UARTCR_TXE_RESET, 0x1
.equ	UART_UARTCR_TXE_BITS, 0x00000100
.equ	UART_UARTCR_TXE_MSB, 8
.equ	UART_UARTCR_TXE_LSB, 8
# -----------------------------------------------------------------------------
# Field       : UART_UARTCR_LBE
# Description : Loopback enable. If this bit is set to 1 and the SIREN bit is
#               set to 1 and the SIRTEST bit in the Test Control Register,
#               UARTTCR is set to 1, then the nSIROUT path is inverted, and fed
#               through to the SIRIN path. The SIRTEST bit in the test register
#               must be set to 1 to override the normal half-duplex SIR
#               operation. This must be the requirement for accessing the test
#               registers during normal operation, and SIRTEST must be cleared
#               to 0 when loopback testing is finished. This feature reduces
#               the amount of external coupling required during system test. If
#               this bit is set to 1, and the SIRTEST bit is set to 0, the
#               UARTTXD path is fed through to the UARTRXD path. In either SIR
#               mode or UART mode, when this bit is set, the modem outputs are
#               also fed through to the modem inputs. This bit is cleared to 0
#               on reset, to disable loopback.
.equ	UART_UARTCR_LBE_RESET, 0x0
.equ	UART_UARTCR_LBE_BITS, 0x00000080
.equ	UART_UARTCR_LBE_MSB, 7
.equ	UART_UARTCR_LBE_LSB, 7
# -----------------------------------------------------------------------------
# Field       : UART_UARTCR_SIRLP
# Description : SIR low-power IrDA mode. This bit selects the IrDA encoding
#               mode. If this bit is cleared to 0, low-level bits are
#               transmitted as an active high pulse with a width of 3 / 16th of
#               the bit period. If this bit is set to 1, low-level bits are
#               transmitted with a pulse width that is 3 times the period of
#               the IrLPBaud16 input signal, regardless of the selected bit
#               rate. Setting this bit uses less power, but might reduce
#               transmission distances.
.equ	UART_UARTCR_SIRLP_RESET, 0x0
.equ	UART_UARTCR_SIRLP_BITS, 0x00000004
.equ	UART_UARTCR_SIRLP_MSB, 2
