konstantin-dzreev/bare-metal-rp2350-riscv/include/hardware/regs/uart.inc
.equ	UART_UARTCR_SIRLP_LSB, 2
# -----------------------------------------------------------------------------
# Field       : UART_UARTCR_SIREN
# Description : SIR enable: 0 = IrDA SIR ENDEC is disabled. nSIROUT remains LOW
#               (no light pulse generated), and signal transitions on SIRIN
#               have no effect. 1 = IrDA SIR ENDEC is enabled. Data is
#               transmitted and received on nSIROUT and SIRIN. UARTTXD remains
#               HIGH, in the marking state. Signal transitions on UARTRXD or
#               modem status inputs have no effect. This bit has no effect if
#               the UARTEN bit disables the UART.
.equ	UART_UARTCR_SIREN_RESET, 0x0
.equ	UART_UARTCR_SIREN_BITS, 0x00000002
.equ	UART_UARTCR_SIREN_MSB, 1
.equ	UART_UARTCR_SIREN_LSB, 1
# -----------------------------------------------------------------------------
# Field       : UART_UARTCR_UARTEN
# Description : UART enable: 0 = UART is disabled. If the UART is disabled in
#               the middle of transmission or reception, it completes the
#               current character before stopping. 1 = the UART is enabled.
#               Data transmission and reception occurs for either UART signals
#               or SIR signals depending on the setting of the SIREN bit.
.equ	UART_UARTCR_UARTEN_RESET, 0x0
.equ	UART_UARTCR_UARTEN_BITS, 0x00000001
.equ	UART_UARTCR_UARTEN_MSB, 0
.equ	UART_UARTCR_UARTEN_LSB, 0
# =============================================================================
# Register    : UART_UARTIFLS
# Description : Interrupt FIFO Level Select Register, UARTIFLS
.equ	UART_UARTIFLS_OFFSET, 0x00000034
.equ	UART_UARTIFLS_BITS, 0x0000003f
.equ	UART_UARTIFLS_RESET, 0x00000012
# -----------------------------------------------------------------------------
# Field       : UART_UARTIFLS_RXIFLSEL
# Description : Receive interrupt FIFO level select. The trigger points for the
#               receive interrupt are as follows: b000 = Receive FIFO becomes
#               >= 1 / 8 full b001 = Receive FIFO becomes >= 1 / 4 full b010 =
#               Receive FIFO becomes >= 1 / 2 full b011 = Receive FIFO becomes
#               >= 3 / 4 full b100 = Receive FIFO becomes >= 7 / 8 full
#               b101-b111 = reserved.
.equ	UART_UARTIFLS_RXIFLSEL_RESET, 0x2
.equ	UART_UARTIFLS_RXIFLSEL_BITS, 0x00000038
.equ	UART_UARTIFLS_RXIFLSEL_MSB, 5
.equ	UART_UARTIFLS_RXIFLSEL_LSB, 3
# -----------------------------------------------------------------------------
# Field       : UART_UARTIFLS_TXIFLSEL
# Description : Transmit interrupt FIFO level select. The trigger points for
#               the transmit interrupt are as follows: b000 = Transmit FIFO
#               becomes <= 1 / 8 full b001 = Transmit FIFO becomes <= 1 / 4
#               full b010 = Transmit FIFO becomes <= 1 / 2 full b011 = Transmit
#               FIFO becomes <= 3 / 4 full b100 = Transmit FIFO becomes <= 7 /
#               8 full b101-b111 = reserved.
.equ	UART_UARTIFLS_TXIFLSEL_RESET, 0x2
.equ	UART_UARTIFLS_TXIFLSEL_BITS, 0x00000007
.equ	UART_UARTIFLS_TXIFLSEL_MSB, 2
.equ	UART_UARTIFLS_TXIFLSEL_LSB, 0
# =============================================================================
# Register    : UART_UARTIMSC
# Description : Interrupt Mask Set/Clear Register, UARTIMSC
.equ	UART_UARTIMSC_OFFSET, 0x00000038
.equ	UART_UARTIMSC_BITS, 0x000007ff
.equ	UART_UARTIMSC_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : UART_UARTIMSC_OEIM
# Description : Overrun error interrupt mask. A read returns the current mask
#               for the UARTOEINTR interrupt. On a write of 1, the mask of the
#               UARTOEINTR interrupt is set. A write of 0 clears the mask.
.equ	UART_UARTIMSC_OEIM_RESET, 0x0
.equ	UART_UARTIMSC_OEIM_BITS, 0x00000400
.equ	UART_UARTIMSC_OEIM_MSB, 10
.equ	UART_UARTIMSC_OEIM_LSB, 10
# -----------------------------------------------------------------------------
# Field       : UART_UARTIMSC_BEIM
# Description : Break error interrupt mask. A read returns the current mask for
#               the UARTBEINTR interrupt. On a write of 1, the mask of the
#               UARTBEINTR interrupt is set. A write of 0 clears the mask.
.equ	UART_UARTIMSC_BEIM_RESET, 0x0
.equ	UART_UARTIMSC_BEIM_BITS, 0x00000200
.equ	UART_UARTIMSC_BEIM_MSB, 9
.equ	UART_UARTIMSC_BEIM_LSB, 9
# -----------------------------------------------------------------------------
# Field       : UART_UARTIMSC_PEIM
# Description : Parity error interrupt mask. A read returns the current mask
#               for the UARTPEINTR interrupt. On a write of 1, the mask of the
#               UARTPEINTR interrupt is set. A write of 0 clears the mask.
.equ	UART_UARTIMSC_PEIM_RESET, 0x0
.equ	UART_UARTIMSC_PEIM_BITS, 0x00000100
.equ	UART_UARTIMSC_PEIM_MSB, 8
.equ	UART_UARTIMSC_PEIM_LSB, 8
# -----------------------------------------------------------------------------
# Field       : UART_UARTIMSC_FEIM
# Description : Framing error interrupt mask. A read returns the current mask
#               for the UARTFEINTR interrupt. On a write of 1, the mask of the
#               UARTFEINTR interrupt is set. A write of 0 clears the mask.
.equ	UART_UARTIMSC_FEIM_RESET, 0x0
.equ	UART_UARTIMSC_FEIM_BITS, 0x00000080
.equ	UART_UARTIMSC_FEIM_MSB, 7
.equ	UART_UARTIMSC_FEIM_LSB, 7
# -----------------------------------------------------------------------------
# Field       : UART_UARTIMSC_RTIM
# Description : Receive timeout interrupt mask. A read returns the current mask
#               for the UARTRTINTR interrupt. On a write of 1, the mask of the
#               UARTRTINTR interrupt is set. A write of 0 clears the mask.
.equ	UART_UARTIMSC_RTIM_RESET, 0x0
.equ	UART_UARTIMSC_RTIM_BITS, 0x00000040
.equ	UART_UARTIMSC_RTIM_MSB, 6
.equ	UART_UARTIMSC_RTIM_LSB, 6
# -----------------------------------------------------------------------------
# Field       : UART_UARTIMSC_TXIM
# Description : Transmit interrupt mask. A read returns the current mask for
#               the UARTTXINTR interrupt. On a write of 1, the mask of the
#               UARTTXINTR interrupt is set. A write of 0 clears the mask.
.equ	UART_UARTIMSC_TXIM_RESET, 0x0
.equ	UART_UARTIMSC_TXIM_BITS, 0x00000020
.equ	UART_UARTIMSC_TXIM_MSB, 5
.equ	UART_UARTIMSC_TXIM_LSB, 5
# -----------------------------------------------------------------------------
# Field       : UART_UARTIMSC_RXIM
# Description : Receive interrupt mask. A read returns the current mask for the
#               UARTRXINTR interrupt. On a write of 1, the mask of the
#               UARTRXINTR interrupt is set. A write of 0 clears the mask.
.equ	UART_UARTIMSC_RXIM_RESET, 0x0
.equ	UART_UARTIMSC_RXIM_BITS, 0x00000010
.equ	UART_UARTIMSC_RXIM_MSB, 4
.equ	UART_UARTIMSC_RXIM_LSB, 4
# -----------------------------------------------------------------------------
# Field       : UART_UARTIMSC_DSRMIM
# Description : nUARTDSR modem interrupt mask. A read returns the current mask
#               for the UARTDSRINTR interrupt. On a write of 1, the mask of the
#               UARTDSRINTR interrupt is set. A write of 0 clears the mask.
.equ	UART_UARTIMSC_DSRMIM_RESET, 0x0
.equ	UART_UARTIMSC_DSRMIM_BITS, 0x00000008
.equ	UART_UARTIMSC_DSRMIM_MSB, 3
.equ	UART_UARTIMSC_DSRMIM_LSB, 3
# -----------------------------------------------------------------------------
# Field       : UART_UARTIMSC_DCDMIM
# Description : nUARTDCD modem interrupt mask. A read returns the current mask
#               for the UARTDCDINTR interrupt. On a write of 1, the mask of the
#               UARTDCDINTR interrupt is set. A write of 0 clears the mask.
.equ	UART_UARTIMSC_DCDMIM_RESET, 0x0
.equ	UART_UARTIMSC_DCDMIM_BITS, 0x00000004
.equ	UART_UARTIMSC_DCDMIM_MSB, 2
.equ	UART_UARTIMSC_DCDMIM_LSB, 2
# -----------------------------------------------------------------------------
# Field       : UART_UARTIMSC_CTSMIM
# Description : nUARTCTS modem interrupt mask. A read returns the current mask
#               for the UARTCTSINTR interrupt. On a write of 1, the mask of the
#               UARTCTSINTR interrupt is set. A write of 0 clears the mask.
.equ	UART_UARTIMSC_CTSMIM_RESET, 0x0
.equ	UART_UARTIMSC_CTSMIM_BITS, 0x00000002
.equ	UART_UARTIMSC_CTSMIM_MSB, 1
.equ	UART_UARTIMSC_CTSMIM_LSB, 1
# -----------------------------------------------------------------------------
# Field       : UART_UARTIMSC_RIMIM
# Description : nUARTRI modem interrupt mask. A read returns the current mask
#               for the UARTRIINTR interrupt. On a write of 1, the mask of the
#               UARTRIINTR interrupt is set. A write of 0 clears the mask.
.equ	UART_UARTIMSC_RIMIM_RESET, 0x0
.equ	UART_UARTIMSC_RIMIM_BITS, 0x00000001
.equ	UART_UARTIMSC_RIMIM_MSB, 0
.equ	UART_UARTIMSC_RIMIM_LSB, 0
# =============================================================================
# Register    : UART_UARTRIS
# Description : Raw Interrupt Status Register, UARTRIS
.equ	UART_UARTRIS_OFFSET, 0x0000003c
.equ	UART_UARTRIS_BITS, 0x000007ff
.equ	UART_UARTRIS_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : UART_UARTRIS_OERIS
# Description : Overrun error interrupt status. Returns the raw interrupt state
#               of the UARTOEINTR interrupt.
.equ	UART_UARTRIS_OERIS_RESET, 0x0
.equ	UART_UARTRIS_OERIS_BITS, 0x00000400
.equ	UART_UARTRIS_OERIS_MSB, 10
.equ	UART_UARTRIS_OERIS_LSB, 10
# -----------------------------------------------------------------------------
# Field       : UART_UARTRIS_BERIS
# Description : Break error interrupt status. Returns the raw interrupt state
#               of the UARTBEINTR interrupt.
.equ	UART_UARTRIS_BERIS_RESET, 0x0
.equ	UART_UARTRIS_BERIS_BITS, 0x00000200
.equ	UART_UARTRIS_BERIS_MSB, 9
.equ	UART_UARTRIS_BERIS_LSB, 9
# -----------------------------------------------------------------------------
# Field       : UART_UARTRIS_PERIS
# Description : Parity error interrupt status. Returns the raw interrupt state
#               of the UARTPEINTR interrupt.
.equ	UART_UARTRIS_PERIS_RESET, 0x0
.equ	UART_UARTRIS_PERIS_BITS, 0x00000100
.equ	UART_UARTRIS_PERIS_MSB, 8
.equ	UART_UARTRIS_PERIS_LSB, 8
# -----------------------------------------------------------------------------
# Field       : UART_UARTRIS_FERIS
# Description : Framing error interrupt status. Returns the raw interrupt state
#               of the UARTFEINTR interrupt.
.equ	UART_UARTRIS_FERIS_RESET, 0x0
.equ	UART_UARTRIS_FERIS_BITS, 0x00000080
.equ	UART_UARTRIS_FERIS_MSB, 7
.equ	UART_UARTRIS_FERIS_LSB, 7
# -----------------------------------------------------------------------------
# Field       : UART_UARTRIS_RTRIS
# Description : Receive timeout interrupt status. Returns the raw interrupt
#               state of the UARTRTINTR interrupt. a
.equ	UART_UARTRIS_RTRIS_RESET, 0x0
.equ	UART_UARTRIS_RTRIS_BITS, 0x00000040
.equ	UART_UARTRIS_RTRIS_MSB, 6
.equ	UART_UARTRIS_RTRIS_LSB, 6
# -----------------------------------------------------------------------------
# Field       : UART_UARTRIS_TXRIS
# Description : Transmit interrupt status. Returns the raw interrupt state of
#               the UARTTXINTR interrupt.
.equ	UART_UARTRIS_TXRIS_RESET, 0x0
.equ	UART_UARTRIS_TXRIS_BITS, 0x00000020
.equ	UART_UARTRIS_TXRIS_MSB, 5
.equ	UART_UARTRIS_TXRIS_LSB, 5
# -----------------------------------------------------------------------------
# Field       : UART_UARTRIS_RXRIS
# Description : Receive interrupt status. Returns the raw interrupt state of
#               the UARTRXINTR interrupt.
.equ	UART_UARTRIS_RXRIS_RESET, 0x0
.equ	UART_UARTRIS_RXRIS_BITS, 0x00000010
.equ	UART_UARTRIS_RXRIS_MSB, 4
.equ	UART_UARTRIS_RXRIS_LSB, 4
# -----------------------------------------------------------------------------
# Field       : UART_UARTRIS_DSRRMIS
# Description : nUARTDSR modem interrupt status. Returns the raw interrupt
#               state of the UARTDSRINTR interrupt.
.equ	UART_UARTRIS_DSRRMIS_BITS, 0x00000008
.equ	UART_UARTRIS_DSRRMIS_MSB, 3
.equ	UART_UARTRIS_DSRRMIS_LSB, 3
# -----------------------------------------------------------------------------
# Field       : UART_UARTRIS_DCDRMIS
# Description : nUARTDCD modem interrupt status. Returns the raw interrupt
#               state of the UARTDCDINTR interrupt.
.equ	UART_UARTRIS_DCDRMIS_BITS, 0x00000004
.equ	UART_UARTRIS_DCDRMIS_MSB, 2
.equ	UART_UARTRIS_DCDRMIS_LSB, 2
# -----------------------------------------------------------------------------
# Field       : UART_UARTRIS_CTSRMIS
# Description : nUARTCTS modem interrupt status. Returns the raw interrupt
#               state of the UARTCTSINTR interrupt.
.equ	UART_UARTRIS_CTSRMIS_BITS, 0x00000002
.equ	UART_UARTRIS_CTSRMIS_MSB, 1
.equ	UART_UARTRIS_CTSRMIS_LSB, 1
# -----------------------------------------------------------------------------
# Field       : UART_UARTRIS_RIRMIS
# Description : nUARTRI modem interrupt status. Returns the raw interrupt state
#               of the UARTRIINTR interrupt.
.equ	UART_UARTRIS_RIRMIS_BITS, 0x00000001
.equ	UART_UARTRIS_RIRMIS_MSB, 0
.equ	UART_UARTRIS_RIRMIS_LSB, 0
# =============================================================================
# Register    : UART_UARTMIS
# Description : Masked Interrupt Status Register, UARTMIS
.equ	UART_UARTMIS_OFFSET, 0x00000040
.equ	UART_UARTMIS_BITS, 0x000007ff
.equ	UART_UARTMIS_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : UART_UARTMIS_OEMIS
# Description : Overrun error masked interrupt status. Returns the masked
#               interrupt state of the UARTOEINTR interrupt.
.equ	UART_UARTMIS_OEMIS_RESET, 0x0
.equ	UART_UARTMIS_OEMIS_BITS, 0x00000400
.equ	UART_UARTMIS_OEMIS_MSB, 10
.equ	UART_UARTMIS_OEMIS_LSB, 10
# -----------------------------------------------------------------------------
# Field       : UART_UARTMIS_BEMIS
# Description : Break error masked interrupt status. Returns the masked
#               interrupt state of the UARTBEINTR interrupt.
.equ	UART_UARTMIS_BEMIS_RESET, 0x0
.equ	UART_UARTMIS_BEMIS_BITS, 0x00000200
.equ	UART_UARTMIS_BEMIS_MSB, 9
.equ	UART_UARTMIS_BEMIS_LSB, 9
# -----------------------------------------------------------------------------
# Field       : UART_UARTMIS_PEMIS
# Description : Parity error masked interrupt status. Returns the masked
#               interrupt state of the UARTPEINTR interrupt.
.equ	UART_UARTMIS_PEMIS_RESET, 0x0
.equ	UART_UARTMIS_PEMIS_BITS, 0x00000100
.equ	UART_UARTMIS_PEMIS_MSB, 8
.equ	UART_UARTMIS_PEMIS_LSB, 8
# -----------------------------------------------------------------------------
# Field       : UART_UARTMIS_FEMIS
# Description : Framing error masked interrupt status. Returns the masked
#               interrupt state of the UARTFEINTR interrupt.
.equ	UART_UARTMIS_FEMIS_RESET, 0x0
.equ	UART_UARTMIS_FEMIS_BITS, 0x00000080
.equ	UART_UARTMIS_FEMIS_MSB, 7
.equ	UART_UARTMIS_FEMIS_LSB, 7
# -----------------------------------------------------------------------------
# Field       : UART_UARTMIS_RTMIS
# Description : Receive timeout masked interrupt status. Returns the masked
#               interrupt state of the UARTRTINTR interrupt.
.equ	UART_UARTMIS_RTMIS_RESET, 0x0
.equ	UART_UARTMIS_RTMIS_BITS, 0x00000040
.equ	UART_UARTMIS_RTMIS_MSB, 6
.equ	UART_UARTMIS_RTMIS_LSB, 6
# -----------------------------------------------------------------------------
# Field       : UART_UARTMIS_TXMIS
# Description : Transmit masked interrupt status. Returns the masked interrupt
#               state of the UARTTXINTR interrupt.
.equ	UART_UARTMIS_TXMIS_RESET, 0x0
.equ	UART_UARTMIS_TXMIS_BITS, 0x00000020
.equ	UART_UARTMIS_TXMIS_MSB, 5
.equ	UART_UARTMIS_TXMIS_LSB, 5
# -----------------------------------------------------------------------------
# Field       : UART_UARTMIS_RXMIS
# Description : Receive masked interrupt status. Returns the masked interrupt
#               state of the UARTRXINTR interrupt.
.equ	UART_UARTMIS_RXMIS_RESET, 0x0
.equ	UART_UARTMIS_RXMIS_BITS, 0x00000010
.equ	UART_UARTMIS_RXMIS_MSB, 4
.equ	UART_UARTMIS_RXMIS_LSB, 4
# -----------------------------------------------------------------------------
# Field       : UART_UARTMIS_DSRMMIS
# Description : nUARTDSR modem masked interrupt status. Returns the masked
#               interrupt state of the UARTDSRINTR interrupt.
.equ	UART_UARTMIS_DSRMMIS_BITS, 0x00000008
.equ	UART_UARTMIS_DSRMMIS_MSB, 3
.equ	UART_UARTMIS_DSRMMIS_LSB, 3
# -----------------------------------------------------------------------------
# Field       : UART_UARTMIS_DCDMMIS
# Description : nUARTDCD modem masked interrupt status. Returns the masked
#               interrupt state of the UARTDCDINTR interrupt.
.equ	UART_UARTMIS_DCDMMIS_BITS, 0x00000004
.equ	UART_UARTMIS_DCDMMIS_MSB, 2
.equ	UART_UARTMIS_DCDMMIS_LSB, 2
# -----------------------------------------------------------------------------
# Field       : UART_UARTMIS_CTSMMIS
# Description : nUARTCTS modem masked interrupt status. Returns the masked
#               interrupt state of the UARTCTSINTR interrupt.
.equ	UART_UARTMIS_CTSMMIS_BITS, 0x00000002
.equ	UART_UARTMIS_CTSMMIS_MSB, 1
.equ	UART_UARTMIS_CTSMMIS_LSB, 1
# -----------------------------------------------------------------------------
# Field       : UART_UARTMIS_RIMMIS
# Description : nUARTRI modem masked interrupt status. Returns the masked
#               interrupt state of the UARTRIINTR interrupt.
.equ	UART_UARTMIS_RIMMIS_BITS, 0x00000001
.equ	UART_UARTMIS_RIMMIS_MSB, 0
.equ	UART_UARTMIS_RIMMIS_LSB, 0
# =============================================================================
# Register    : UART_UARTICR
# Description : Interrupt Clear Register, UARTICR
.equ	UART_UARTICR_OFFSET, 0x00000044
.equ	UART_UARTICR_BITS, 0x000007ff
.equ	UART_UARTICR_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : UART_UARTICR_OEIC
# Description : Overrun error interrupt clear. Clears the UARTOEINTR interrupt.
.equ	UART_UARTICR_OEIC_BITS, 0x00000400
.equ	UART_UARTICR_OEIC_MSB, 10
.equ	UART_UARTICR_OEIC_LSB, 10
# -----------------------------------------------------------------------------
# Field       : UART_UARTICR_BEIC
# Description : Break error interrupt clear. Clears the UARTBEINTR interrupt.
.equ	UART_UARTICR_BEIC_BITS, 0x00000200
.equ	UART_UARTICR_BEIC_MSB, 9
.equ	UART_UARTICR_BEIC_LSB, 9
# -----------------------------------------------------------------------------
# Field       : UART_UARTICR_PEIC
# Description : Parity error interrupt clear. Clears the UARTPEINTR interrupt.
.equ	UART_UARTICR_PEIC_BITS, 0x00000100
.equ	UART_UARTICR_PEIC_MSB, 8
.equ	UART_UARTICR_PEIC_LSB, 8
# -----------------------------------------------------------------------------
# Field       : UART_UARTICR_FEIC
# Description : Framing error interrupt clear. Clears the UARTFEINTR interrupt.
.equ	UART_UARTICR_FEIC_BITS, 0x00000080
.equ	UART_UARTICR_FEIC_MSB, 7
.equ	UART_UARTICR_FEIC_LSB, 7
# -----------------------------------------------------------------------------
# Field       : UART_UARTICR_RTIC
# Description : Receive timeout interrupt clear. Clears the UARTRTINTR
#               interrupt.
.equ	UART_UARTICR_RTIC_BITS, 0x00000040
.equ	UART_UARTICR_RTIC_MSB, 6
.equ	UART_UARTICR_RTIC_LSB, 6
# -----------------------------------------------------------------------------
# Field       : UART_UARTICR_TXIC
# Description : Transmit interrupt clear. Clears the UARTTXINTR interrupt.
.equ	UART_UARTICR_TXIC_BITS, 0x00000020
.equ	UART_UARTICR_TXIC_MSB, 5
.equ	UART_UARTICR_TXIC_LSB, 5
# -----------------------------------------------------------------------------
# Field       : UART_UARTICR_RXIC
# Description : Receive interrupt clear. Clears the UARTRXINTR interrupt.
.equ	UART_UARTICR_RXIC_BITS, 0x00000010
.equ	UART_UARTICR_RXIC_MSB, 4
.equ	UART_UARTICR_RXIC_LSB, 4
# -----------------------------------------------------------------------------
# Field       : UART_UARTICR_DSRMIC
# Description : nUARTDSR modem interrupt clear. Clears the UARTDSRINTR
#               interrupt.
.equ	UART_UARTICR_DSRMIC_BITS, 0x00000008
.equ	UART_UARTICR_DSRMIC_MSB, 3
.equ	UART_UARTICR_DSRMIC_LSB, 3
# -----------------------------------------------------------------------------
# Field       : UART_UARTICR_DCDMIC
# Description : nUARTDCD modem interrupt clear. Clears the UARTDCDINTR
#               interrupt.
.equ	UART_UARTICR_DCDMIC_BITS, 0x00000004
.equ	UART_UARTICR_DCDMIC_MSB, 2
.equ	UART_UARTICR_DCDMIC_LSB, 2
# -----------------------------------------------------------------------------
# Field       : UART_UARTICR_CTSMIC
# Description : nUARTCTS modem interrupt clear. Clears the UARTCTSINTR
#               interrupt.
.equ	UART_UARTICR_CTSMIC_BITS, 0x00000002
.equ	UART_UARTICR_CTSMIC_MSB, 1
.equ	UART_UARTICR_CTSMIC_LSB, 1
# -----------------------------------------------------------------------------
# Field       : UART_UARTICR_RIMIC
# Description : nUARTRI modem interrupt clear. Clears the UARTRIINTR interrupt.
.equ	UART_UARTICR_RIMIC_BITS, 0x00000001
.equ	UART_UARTICR_RIMIC_MSB, 0
.equ	UART_UARTICR_RIMIC_LSB, 0
# =============================================================================
# Register    : UART_UARTDMACR
# Description : DMA Control Register, UARTDMACR
.equ	UART_UARTDMACR_OFFSET, 0x00000048
.equ	UART_UARTDMACR_BITS, 0x00000007
.equ	UART_UARTDMACR_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : UART_UARTDMACR_DMAONERR
# Description : DMA on error. If this bit is set to 1, the DMA receive request
#               outputs, UARTRXDMASREQ or UARTRXDMABREQ, are disabled when the
#               UART error interrupt is asserted.
.equ	UART_UARTDMACR_DMAONERR_RESET, 0x0
.equ	UART_UARTDMACR_DMAONERR_BITS, 0x00000004
.equ	UART_UARTDMACR_DMAONERR_MSB, 2
.equ	UART_UARTDMACR_DMAONERR_LSB, 2
# -----------------------------------------------------------------------------
# Field       : UART_UARTDMACR_TXDMAE
# Description : Transmit DMA enable. If this bit is set to 1, DMA for the
#               transmit FIFO is enabled.
.equ	UART_UARTDMACR_TXDMAE_RESET, 0x0
.equ	UART_UARTDMACR_TXDMAE_BITS, 0x00000002
.equ	UART_UARTDMACR_TXDMAE_MSB, 1
.equ	UART_UARTDMACR_TXDMAE_LSB, 1
# -----------------------------------------------------------------------------
# Field       : UART_UARTDMACR_RXDMAE
# Description : Receive DMA enable. If this bit is set to 1, DMA for the
#               receive FIFO is enabled.
.equ	UART_UARTDMACR_RXDMAE_RESET, 0x0
.equ	UART_UARTDMACR_RXDMAE_BITS, 0x00000001
.equ	UART_UARTDMACR_RXDMAE_MSB, 0
.equ	UART_UARTDMACR_RXDMAE_LSB, 0
# =============================================================================
# Register    : UART_UARTPERIPHID0
# Description : UARTPeriphID0 Register
.equ	UART_UARTPERIPHID0_OFFSET, 0x00000fe0
.equ	UART_UARTPERIPHID0_BITS, 0x000000ff
.equ	UART_UARTPERIPHID0_RESET, 0x00000011
# -----------------------------------------------------------------------------
# Field       : UART_UARTPERIPHID0_PARTNUMBER0
# Description : These bits read back as 0x11
.equ	UART_UARTPERIPHID0_PARTNUMBER0_RESET, 0x11
.equ	UART_UARTPERIPHID0_PARTNUMBER0_BITS, 0x000000ff
.equ	UART_UARTPERIPHID0_PARTNUMBER0_MSB, 7
.equ	UART_UARTPERIPHID0_PARTNUMBER0_LSB, 0
# =============================================================================
# Register    : UART_UARTPERIPHID1
# Description : UARTPeriphID1 Register
.equ	UART_UARTPERIPHID1_OFFSET, 0x00000fe4
.equ	UART_UARTPERIPHID1_BITS, 0x000000ff
.equ	UART_UARTPERIPHID1_RESET, 0x00000010
# -----------------------------------------------------------------------------
# Field       : UART_UARTPERIPHID1_DESIGNER0
# Description : These bits read back as 0x1
.equ	UART_UARTPERIPHID1_DESIGNER0_RESET, 0x1
.equ	UART_UARTPERIPHID1_DESIGNER0_BITS, 0x000000f0
.equ	UART_UARTPERIPHID1_DESIGNER0_MSB, 7
.equ	UART_UARTPERIPHID1_DESIGNER0_LSB, 4
# -----------------------------------------------------------------------------
