konstantin-dzreev/bare-metal-rp2350-riscv/include/hardware/regs/uart.inc
# Field       : UART_UARTPERIPHID1_PARTNUMBER1
# Description : These bits read back as 0x0
.equ	UART_UARTPERIPHID1_PARTNUMBER1_RESET, 0x0
.equ	UART_UARTPERIPHID1_PARTNUMBER1_BITS, 0x0000000f
.equ	UART_UARTPERIPHID1_PARTNUMBER1_MSB, 3
.equ	UART_UARTPERIPHID1_PARTNUMBER1_LSB, 0
# =============================================================================
# Register    : UART_UARTPERIPHID2
# Description : UARTPeriphID2 Register
.equ	UART_UARTPERIPHID2_OFFSET, 0x00000fe8
.equ	UART_UARTPERIPHID2_BITS, 0x000000ff
.equ	UART_UARTPERIPHID2_RESET, 0x00000034
# -----------------------------------------------------------------------------
# Field       : UART_UARTPERIPHID2_REVISION
# Description : This field depends on the revision of the UART: r1p0 0x0 r1p1
#               0x1 r1p3 0x2 r1p4 0x2 r1p5 0x3
.equ	UART_UARTPERIPHID2_REVISION_RESET, 0x3
.equ	UART_UARTPERIPHID2_REVISION_BITS, 0x000000f0
.equ	UART_UARTPERIPHID2_REVISION_MSB, 7
.equ	UART_UARTPERIPHID2_REVISION_LSB, 4
# -----------------------------------------------------------------------------
# Field       : UART_UARTPERIPHID2_DESIGNER1
# Description : These bits read back as 0x4
.equ	UART_UARTPERIPHID2_DESIGNER1_RESET, 0x4
.equ	UART_UARTPERIPHID2_DESIGNER1_BITS, 0x0000000f
.equ	UART_UARTPERIPHID2_DESIGNER1_MSB, 3
.equ	UART_UARTPERIPHID2_DESIGNER1_LSB, 0
# =============================================================================
# Register    : UART_UARTPERIPHID3
# Description : UARTPeriphID3 Register
.equ	UART_UARTPERIPHID3_OFFSET, 0x00000fec
.equ	UART_UARTPERIPHID3_BITS, 0x000000ff
.equ	UART_UARTPERIPHID3_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : UART_UARTPERIPHID3_CONFIGURATION
# Description : These bits read back as 0x00
.equ	UART_UARTPERIPHID3_CONFIGURATION_RESET, 0x00
.equ	UART_UARTPERIPHID3_CONFIGURATION_BITS, 0x000000ff
.equ	UART_UARTPERIPHID3_CONFIGURATION_MSB, 7
.equ	UART_UARTPERIPHID3_CONFIGURATION_LSB, 0
# =============================================================================
# Register    : UART_UARTPCELLID0
# Description : UARTPCellID0 Register
.equ	UART_UARTPCELLID0_OFFSET, 0x00000ff0
.equ	UART_UARTPCELLID0_BITS, 0x000000ff
.equ	UART_UARTPCELLID0_RESET, 0x0000000d
# -----------------------------------------------------------------------------
# Field       : UART_UARTPCELLID0_UARTPCELLID0
# Description : These bits read back as 0x0D
.equ	UART_UARTPCELLID0_UARTPCELLID0_RESET, 0x0d
.equ	UART_UARTPCELLID0_UARTPCELLID0_BITS, 0x000000ff
.equ	UART_UARTPCELLID0_UARTPCELLID0_MSB, 7
.equ	UART_UARTPCELLID0_UARTPCELLID0_LSB, 0
# =============================================================================
# Register    : UART_UARTPCELLID1
# Description : UARTPCellID1 Register
.equ	UART_UARTPCELLID1_OFFSET, 0x00000ff4
.equ	UART_UARTPCELLID1_BITS, 0x000000ff
.equ	UART_UARTPCELLID1_RESET, 0x000000f0
# -----------------------------------------------------------------------------
# Field       : UART_UARTPCELLID1_UARTPCELLID1
# Description : These bits read back as 0xF0
.equ	UART_UARTPCELLID1_UARTPCELLID1_RESET, 0xf0
.equ	UART_UARTPCELLID1_UARTPCELLID1_BITS, 0x000000ff
.equ	UART_UARTPCELLID1_UARTPCELLID1_MSB, 7
.equ	UART_UARTPCELLID1_UARTPCELLID1_LSB, 0
# =============================================================================
# Register    : UART_UARTPCELLID2
# Description : UARTPCellID2 Register
.equ	UART_UARTPCELLID2_OFFSET, 0x00000ff8
.equ	UART_UARTPCELLID2_BITS, 0x000000ff
.equ	UART_UARTPCELLID2_RESET, 0x00000005
# -----------------------------------------------------------------------------
# Field       : UART_UARTPCELLID2_UARTPCELLID2
# Description : These bits read back as 0x05
.equ	UART_UARTPCELLID2_UARTPCELLID2_RESET, 0x05
.equ	UART_UARTPCELLID2_UARTPCELLID2_BITS, 0x000000ff
.equ	UART_UARTPCELLID2_UARTPCELLID2_MSB, 7
.equ	UART_UARTPCELLID2_UARTPCELLID2_LSB, 0
# =============================================================================
# Register    : UART_UARTPCELLID3
# Description : UARTPCellID3 Register
.equ	UART_UARTPCELLID3_OFFSET, 0x00000ffc
.equ	UART_UARTPCELLID3_BITS, 0x000000ff
.equ	UART_UARTPCELLID3_RESET, 0x000000b1
# -----------------------------------------------------------------------------
# Field       : UART_UARTPCELLID3_UARTPCELLID3
# Description : These bits read back as 0xB1
.equ	UART_UARTPCELLID3_UARTPCELLID3_RESET, 0xb1
.equ	UART_UARTPCELLID3_UARTPCELLID3_BITS, 0x000000ff
.equ	UART_UARTPCELLID3_UARTPCELLID3_MSB, 7
.equ	UART_UARTPCELLID3_UARTPCELLID3_LSB, 0
# =============================================================================
.endif # _HARDWARE_REGS_UART_H
